Table of Contents
 Interface IIdeaConnectionModel
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Extended IIdeaModel by method related by connection
public interface IIdeaConnectionModel : IIdeaModel
Inherited Members
 IIdeaModel.GetMembers()
 IIdeaModel.GetWholeModel()
 IIdeaModel.GetBulkSelection()
 IIdeaModel.GetSingleSelection()
 IIdeaModel.GetOriginSettings()
 IIdeaModel.GetLoads()
Methods
 ProcessConnection(IIdeaConnectionPoint)
Process connected beams in connection
void ProcessConnection(IIdeaConnectionPoint connectionPoint)
Parameters
connectionPoint IIdeaConnectionPoint
 Edit this page